Revit 2027 API
IFCAnyHandle.SetAttribute(String, ISet<IFCAnyHandle>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	ISet<IFCAnyHandle> values
)
Public Sub SetAttribute (
	name As String,
	values As ISet(Of IFCAnyHandle)
)
public:
void SetAttribute(
	String^ name,
	ISet<IFCAnyHandle^>^ values
)
member SetAttribute :
        name : string *
        values : ISet<IFCAnyHandle> -> unit
Parameters
name String
values ISet<IFCAnyHandle>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace